tap "johanhaleby/kubetail"
tap "oven-sh/bun"
tap "sqldef/sqldef"
brew "giflib"
brew "libpng"
brew "apr"
brew "gettext"
brew "glib"
brew "cairo"
brew "curl"
brew "direnv"
brew "harfbuzz"
brew "pango"
brew "ffmpeg"
brew "freetds", link: false
brew "fzf"
brew "gdbm", link: false
brew "gh"
brew "ghq"
brew "gifsicle"
brew "git"
brew "grep"
brew "hub"
brew "jpeg"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "lazygit"
brew "libavif", link: false
brew "libpq"
brew "librsvg"
brew "libxml2"
brew "libxslt"
brew "libzip", link: false
brew "llvm"
brew "mise"
brew "mysql"
brew "neovim"
brew "ni"
brew "opa"
brew "openldap"
brew "pkgconf"
brew "postgresql@14"
brew "protobuf"
brew "python@3.12"
brew "redis"
brew "ripgrep"
brew "shared-mime-info"
brew "stow"
brew "tig"
brew "tmux"
brew "wget"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zsh-completions"
brew "johanhaleby/kubetail/kubetail", args: ["with-short-names"]
brew "oven-sh/bun/bun"
cask "1password-cli"
cask "alt-tab"
cask "chromium"
cask "claude-code"
cask "docker-desktop"
cask "fig"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "warp"
cask "wezterm"
vscode "ajmnz.prisma-import"
vscode "anthropic.claude-code"
vscode "bierner.comment-tagged-templates"
vscode "christian-kohler.path-intellisense"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-database-client2"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google-cloud-spanner-ecosystem.google-cloud-spanner-driver"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "mtxr.sqltools"
vscode "pkief.material-icon-theme"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "richie5um2.vscode-sort-json"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "withfig.fig"
vscode "yzhang.markdown-all-in-one"
